tests/data/pgbench_pd_2.txt
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: simple update>
scaling factor: 1
query mode: simple
number of clients: 10
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 10665
number of failed transactions: 0 (0.000%)
latency average = 56.259 ms
initial connection time = 51.241 ms
tps = 177.750065 (without initial connection time)
statement latencies in milliseconds and failures:
         0.002           0  \set aid random(1, 100000 * :scale)
         0.001           0  \set bid random(1, 1 * :scale)
         0.001           0  \set tid random(1, 10 * :scale)
         0.001           0  \set delta random(-5000, 5000)
        11.445           0  BEGIN;
        11.403           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        11.303           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
        11.333           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        11.174           0  END;
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: simple update>
scaling factor: 1
query mode: simple
number of clients: 30
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 28399
number of failed transactions: 0 (0.000%)
latency average = 63.758 ms
initial connection time = 144.364 ms
tps = 470.526546 (without initial connection time)
statement latencies in milliseconds and failures:
         0.001           0  \set aid random(1, 100000 * :scale)
         0.001           0  \set bid random(1, 1 * :scale)
         0.000           0  \set tid random(1, 10 * :scale)
         0.000           0  \set delta random(-5000, 5000)
        12.578           0  BEGIN;
        12.858           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        12.893           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
        12.772           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        12.401           0  END;
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: simple update>
scaling factor: 1
query mode: simple
number of clients: 50
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 46951
number of failed transactions: 0 (0.000%)
latency average = 69.974 ms
initial connection time = 1449.527 ms
tps = 714.555703 (without initial connection time)
statement latencies in milliseconds and failures:
         0.001           0  \set aid random(1, 100000 * :scale)
         0.000           0  \set bid random(1, 1 * :scale)
         0.000           0  \set tid random(1, 10 * :scale)
         0.000           0  \set delta random(-5000, 5000)
        12.485           0  BEGIN;
        12.754           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        12.780           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
        12.690           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        12.631           0  END;
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: simple update>
scaling factor: 1
query mode: simple
number of clients: 100
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 104541
number of failed transactions: 0 (0.000%)
latency average = 57.710 ms
initial connection time = 460.126 ms
tps = 1732.798124 (without initial connection time)
statement latencies in milliseconds and failures:
         0.001           0  \set aid random(1, 100000 * :scale)
         0.000           0  \set bid random(1, 1 * :scale)
         0.000           0  \set tid random(1, 10 * :scale)
         0.000           0  \set delta random(-5000, 5000)
        11.399           0  BEGIN;
        11.538           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        11.315           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
        11.549           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        11.386           0  END;
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: simple update>
scaling factor: 1
query mode: simple
number of clients: 300
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 306400
number of failed transactions: 0 (0.000%)
latency average = 57.530 ms
initial connection time = 1523.667 ms
tps = 5214.691078 (without initial connection time)
statement latencies in milliseconds and failures:
         0.001           0  \set aid random(1, 100000 * :scale)
         0.000           0  \set bid random(1, 1 * :scale)
         0.000           0  \set tid random(1, 10 * :scale)
         0.000           0  \set delta random(-5000, 5000)
        11.484           0  BEGIN;
        11.564           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        11.474           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
        11.455           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        11.421           0  END;
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: simple update>
scaling factor: 1
query mode: simple
number of clients: 500
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 339014
number of failed transactions: 0 (0.000%)
latency average = 84.020 ms
initial connection time = 3651.959 ms
tps = 5950.937686 (without initial connection time)
statement latencies in milliseconds and failures:
         0.001           0  \set aid random(1, 100000 * :scale)
         0.000           0  \set bid random(1, 1 * :scale)
         0.000           0  \set tid random(1, 10 * :scale)
         0.000           0  \set delta random(-5000, 5000)
        16.884           0  BEGIN;
        15.503           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        18.017           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
        16.408           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        16.661           0  END;